-----------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\juanc\Documents\example.log
  log type:  text
 opened on:  27 Nov 2024, 11:53:06

. set seed 123456

. use https://www.stata-press.com/data/r18/food_consumption, clear
(Food consumption)

. 
. *Generated demographics and conditional censoring
. gen rural = (runiform() > 0.8)

. gen income = exp(rnormal())+exp(rnormal())*(p_proteins*expfd/10)

. gen aux = (n_adults + n_kids + income - p_fruitveg + p_dairy)*exp(rnormal())

. replace w_flours=0 if aux*aux*aux>20000
(1,083 real changes made)

. replace w_proteins=0 if aux*aux<30
(1,139 real changes made)

. replace w_fruitveg=0 if aux<5
(1,035 real changes made)

. replace w_dairy=0 if aux>30
(996 real changes made)

. gen total = w_fruitveg + w_dairy + w_proteins + w_flours

. drop aux

. save foodcomp_censored.dta, replace
file foodcomp_censored.dta saved

. 
. *Tables and Figures
. *Table 1
. use foodcomp_censored.dta, clear
(Food consumption)

. 
. foreach var in w_proteins w_fruitveg w_dairy w_flours {
  2.         replace `var'=`var'/total
  3.         drop if `var' > .75
  4.         gen d`var' = 0
  5.         replace d`var' = 1 if `var'==0
  6. }
(2,972 real changes made, 1 to missing)
(254 observations deleted)
(1,148 real changes made)
(2,813 real changes made)
(23 observations deleted)
(1,053 real changes made)
(3,020 real changes made)
(204 observations deleted)
(823 real changes made)
(2,761 real changes made)
(58 observations deleted)
(883 real changes made)

. 
. sum w* dw*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     w_dairy |      3,621    .2183173    .2090272          0   .7491639
  w_proteins |      3,621    .3685222    .2450651          0   .7495327
  w_fruitveg |      3,621    .2478326     .174416          0   .7460674
    w_flours |      3,621    .1653279    .1788546          0   .7482014
 ------------+---------------------------------------------------------
 dw_proteins |      3,621    .2427506    .4288048          0          1
 dw_fruitveg |      3,621    .2184479      .41325          0          1
    dw_dairy |      3,621    .2214858    .4153041          0          1
   dw_flours |      3,621    .2438553    .4294657          0          1

. 
. 
. *QUAIDS (Poi 2012)
. quaids w_proteins w_fruitveg w_dairy w_flours, prices(p_proteins p_fruitveg p_dairy p_flours) expenditure(expfd) nolog demographics(income) a
> not(1.6)
(obs = 3,621)
Calculating NLS estimates...
Calculating FGNLS estimates...
FGNLS iteration 2...
FGNLS iteration 3...

Quadratic AIDS model
--------------------
Number of obs          =       3621
Number of demographics =          1
Alpha_0                =        1.6
Log-likelihood         =  6279.8702

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
alpha        |
     alpha_1 |    .249758   .0229213    10.90   0.000     .2048331    .2946829
     alpha_2 |   .3469335   .0166104    20.89   0.000     .3143778    .3794893
     alpha_3 |   .2420425    .019465    12.43   0.000     .2038918    .2801932
     alpha_4 |    .161266   .0164822     9.78   0.000     .1289614    .1935706
-------------+----------------------------------------------------------------
beta         |
      beta_1 |  -.0590112   .0245646    -2.40   0.016    -.1071569   -.0108656
      beta_2 |  -.0874311   .0176123    -4.96   0.000    -.1219505   -.0529117
      beta_3 |   .0922546   .0210315     4.39   0.000     .0510336    .1334756
      beta_4 |   .0541878    .018091     3.00   0.003     .0187301    .0896454
-------------+----------------------------------------------------------------
gamma        |
   gamma_1_1 |   .1018086   .0087507    11.63   0.000     .0846577    .1189596
   gamma_2_1 |  -.0400911   .0059216    -6.77   0.000    -.0516973   -.0284849
   gamma_3_1 |  -.0265707   .0064364    -4.13   0.000    -.0391858   -.0139556
   gamma_4_1 |  -.0351468   .0056001    -6.28   0.000    -.0461228   -.0241708
   gamma_2_2 |   .0368125     .00684     5.38   0.000     .0234063    .0502187
   gamma_3_2 |   .0014939   .0052798     0.28   0.777    -.0088544    .0118422
   gamma_4_2 |   .0017847    .004677     0.38   0.703     -.007382    .0109514
   gamma_3_3 |   .0314075   .0064122     4.90   0.000     .0188397    .0439752
   gamma_4_3 |  -.0063306   .0045509    -1.39   0.164    -.0152501    .0025889
   gamma_4_4 |   .0396927   .0050192     7.91   0.000     .0298552    .0495302
-------------+----------------------------------------------------------------
lambda       |
    lambda_1 |   .0145753   .0063246     2.30   0.021     .0021792    .0269714
    lambda_2 |   .0148686   .0047134     3.15   0.002     .0056305    .0241067
    lambda_3 |   -.019641   .0053705    -3.66   0.000     -.030167    -.009115
    lambda_4 |  -.0098029   .0047478    -2.06   0.039    -.0191085   -.0004973
-------------+----------------------------------------------------------------
eta          |
eta_income_1 |   .0035771   .0002127    16.81   0.000     .0031601     .003994
eta_income_2 |   .0021321   .0001391    15.33   0.000     .0018595    .0024046
eta_income_3 |  -.0031506   .0001819   -17.32   0.000    -.0035072    -.002794
eta_income_4 |  -.0025586   .0001509   -16.96   0.000    -.0028543   -.0022629
-------------+----------------------------------------------------------------
rho          |
  rho_income |   .0546614   .0032845    16.64   0.000     .0482239     .061099
------------------------------------------------------------------------------

. estat exp, atmeans

. mat elas = r(expelas)'

. estat uncomp, atmeans

. mat elas = elas \ vecdiag(r(uncompelas))'

. 
. 
. *Censored QUAIDS estimation
. quaidsce w_proteins w_fruitveg w_dairy w_flours, prices(p_proteins p_fruitveg p_dairy p_flours) expenditure(expfd) nolog demographics(income)
>  anot(1.6) reps(100) 
--------------------------------------------------------------------------------
Parallel Computing with Stata
Child processes: 4
pll_id         : xzkhmw2b15
Running at     : C:\Users\juanc\Documents
Randtype       : datetime
Waiting for the child processes to finish...
child process 0002 has exited without error...
child process 0001 has exited without error...
child process 0003 has exited without error...
child process 0004 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------

parallel bootstrapping                                   Number of obs = 3,621
                                                         Replications  =   100

      Command: quaidsce_c w_proteins w_fruitveg w_dairy w_flours, prices(p_proteins p_fruitveg p_dairy p_flours) expenditure(expfd) nolog
                   demographics(income) anot(1.6) reps(100)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             | coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
alpha        |
     alpha_1 |   .5131127   .1506175     3.41   0.001     .2179078    .8083176
     alpha_2 |   -.004958   .1479769    -0.03   0.973    -.2949874    .2850713
     alpha_3 |   .1164866    .106049     1.10   0.272    -.0913656    .3243388
     alpha_4 |   .1526294   .1201606     1.27   0.204    -.0828809    .3881398
-------------+----------------------------------------------------------------
beta         |
      beta_1 |  -.1731798   .0940301    -1.84   0.066    -.3574754    .0111157
      beta_2 |   .2081177   .1242883     1.67   0.094     -.035483    .4517183
      beta_3 |  -.0532193   .0539188    -0.99   0.324    -.1588982    .0524596
      beta_4 |   .0136258   .0667234     0.20   0.838    -.1171497    .1444014
-------------+----------------------------------------------------------------
gamma        |
   gamma_1_1 |  -.0018786   .0300737    -0.06   0.950    -.0608219    .0570646
   gamma_2_1 |   .0217023   .0291669     0.74   0.457    -.0354638    .0788683
   gamma_3_1 |  -.0228656   .0122577    -1.87   0.062    -.0468903    .0011591
   gamma_4_1 |    .003042   .0123953     0.25   0.806    -.0212523    .0273363
   gamma_2_2 |  -.0367992   .0310531    -1.19   0.236    -.0976622    .0240638
   gamma_3_2 |   .0243893    .013138     1.86   0.063    -.0013607    .0501393
   gamma_4_2 |  -.0092924   .0132449    -0.70   0.483    -.0352519    .0166671
   gamma_3_3 |   .0288763   .0102761     2.81   0.005     .0087355    .0490171
   gamma_4_3 |     -.0304   .0086633    -3.51   0.000    -.0473797   -.0134202
   gamma_4_4 |   .0366504    .009486     3.86   0.000     .0180581    .0552426
-------------+----------------------------------------------------------------
lambda       |
    lambda_1 |   .0465637   .0248157     1.88   0.061    -.0020741    .0952015
    lambda_2 |  -.0538406   .0327263    -1.65   0.100     -.117983    .0103019
    lambda_3 |   .0127779   .0139786     0.91   0.361    -.0146196    .0401753
    lambda_4 |  -.0042582   .0166874    -0.26   0.799     -.036965    .0284486
-------------+----------------------------------------------------------------
delta        |
     delta_1 |   .3209871   .2414342     1.33   0.184    -.1522152    .7941894
     delta_2 |   .5412079   .2447597     2.21   0.027     .0614878    1.020928
     delta_3 |   .6513364   .2729596     2.39   0.017     .1163454    1.186327
     delta_4 |  -.1452045   .2276869    -0.64   0.524    -.5914627    .3010536
-------------+----------------------------------------------------------------
eta          |
eta_income_1 |   .0000842   .0002182     0.39   0.700    -.0003435    .0005119
eta_income_2 |  -.0000188   .0001897    -0.10   0.921    -.0003905    .0003529
eta_income_3 |   -.000912   .0004364    -2.09   0.037    -.0017674   -.0000567
eta_income_4 |   .0008466   .0004657     1.82   0.069    -.0000662    .0017594
-------------+----------------------------------------------------------------
rho          |
  rho_income |   .0040569   8.833334     0.00   1.000    -17.30896    17.31707
-------------+----------------------------------------------------------------
tau          |
        p1_1 |   .0681576   .0691579     0.99   0.324    -.0673894    .2037045
        p2_1 |  -.0734008   .0705894    -1.04   0.298    -.2117534    .0649517
        p3_1 |   .1434102   .0587209     2.44   0.015     .0283193    .2585012
        p4_1 |  -.1193268     .05393    -2.21   0.027    -.2250277   -.0136259
         M_1 |   .1892077   .0434308     4.36   0.000      .104085    .2743305
    income_1 |    .075008   .0068916    10.88   0.000     .0615006    .0885153
      cons_1 |  -.5860506   .1626683    -3.60   0.000    -.9048746   -.2672266
        p1_2 |   .0927324   .0734662     1.26   0.207    -.0512587    .2367236
        p2_2 |  -.1108887   .0790696    -1.40   0.161    -.2658622    .0440849
        p3_2 |    .160484   .0569685     2.82   0.005     .0488279    .2721402
        p4_2 |   -.127254    .057778    -2.20   0.028    -.2404969   -.0140112
         M_2 |   .2169437   .0473669     4.58   0.000     .1241063     .309781
    income_2 |   .0760179   .0075483    10.07   0.000     .0612235    .0908123
      cons_2 |  -.6127188   .1704577    -3.59   0.000    -.9468097    -.278628
        p1_3 |   -.109021   .0843115    -1.29   0.196    -.2742685    .0562266
        p2_3 |  -.0047885   .0915432    -0.05   0.958    -.1842099    .1746329
        p3_3 |   .0342878   .0686064     0.50   0.617    -.1001783    .1687538
        p4_3 |  -.0053752    .055201    -0.10   0.922    -.1135672    .1028169
         M_3 |  -.1539027   .0500207    -3.08   0.002    -.2519415   -.0558639
    income_3 |  -.0332791   .0029248   -11.38   0.000    -.0390117   -.0275466
      cons_3 |   1.973286   .2095915     9.41   0.000     1.562494    2.384078
        p1_4 |  -.1661279   .0843913    -1.97   0.049    -.3315317    -.000724
        p2_4 |   .0305834   .0885965     0.35   0.730    -.1430626    .2042294
        p3_4 |   .0364256    .060664     0.60   0.548    -.0824737    .1553248
        p4_4 |  -.0061891   .0538161    -0.12   0.908    -.1116667    .0992884
         M_4 |  -.1840342   .0427177    -4.31   0.000    -.2677594   -.1003089
    income_4 |  -.0326748   .0029669   -11.01   0.000    -.0384898   -.0268597
      cons_4 |   2.044384   .1887515    10.83   0.000     1.674437     2.41433
-------------+----------------------------------------------------------------
ELAS_INC     |
         e_1 |   1.070331   .1105616     9.68   0.000     .8536339    1.287027
         e_2 |   .9232844   .0959285     9.62   0.000     .7352679    1.111301
         e_3 |   1.008143   .0598077    16.86   0.000      .890922    1.125364
         e_4 |   .9006681   .4500479     2.00   0.045     .0185905    1.782746
-------------+----------------------------------------------------------------
ELAS_UNCOMP  |
       e_1_1 |  -.9609014   .0793198   -12.11   0.000    -1.116365   -.8054373
       e_2_1 |   .0998079   .1185872     0.84   0.400    -.1326186    .3322345
       e_3_1 |   .0280887   .0612397     0.46   0.646    -.0919389    .1481163
       e_4_1 |   .0471818   .0861397     0.55   0.584     -.121649    .2160125
       e_1_2 |   .1545093   .1147528     1.35   0.178    -.0704021    .3794207
       e_2_2 |  -.9689721   .0629885   -15.38   0.000    -1.092427    -.845517
       e_3_2 |   .1294699   .1168925     1.11   0.268    -.0996353     .358575
       e_4_2 |   .1033209   .0571104     1.81   0.070    -.0086134    .2152552
       e_1_3 |  -.0020863   .0533535    -0.04   0.969    -.1066573    .1024847
       e_2_3 |   .0613574   .0456574     1.34   0.179    -.0281296    .1508443
       e_3_3 |  -.9367222   .0676859   -13.84   0.000    -1.069384   -.8040603
       e_4_3 |  -.0518304   .0448502    -1.16   0.248    -.1397352    .0360744
       e_1_4 |  -.1677075   .6442737    -0.26   0.795    -1.430461    1.095046
       e_2_4 |  -.0515224   .3441105    -0.15   0.881    -.7259666    .6229218
       e_3_4 |  -.2418424    .343195    -0.70   0.481    -.9144922    .4308074
       e_4_4 |  -.6838197   .5244858    -1.30   0.192    -1.711793    .3441535
-------------+----------------------------------------------------------------
ELAS_COMP    |
       e_1_1 |  -.5664608   .1145608    -4.94   0.000    -.7909959   -.3419258
       e_2_1 |   .3650708   .1014253     3.60   0.000     .1662808    .5638607
       e_3_1 |   .2617604   .0821392     3.19   0.001     .1007706    .4227502
       e_4_1 |   .2241373   .0707147     3.17   0.002      .085539    .3627357
       e_1_2 |   .4947601   .1008986     4.90   0.000     .2970025    .6925176
       e_2_2 |  -.7401521   .0778483    -9.51   0.000     -.892732   -.5875722
       e_3_2 |   .3310388   .1343537     2.46   0.014     .0677104    .5943673
       e_4_2 |   .2559656   .0521147     4.91   0.000     .1538226    .3581086
       e_1_3 |   .3694367   .0689582     5.36   0.000     .2342811    .5045923
       e_2_3 |    .311208   .0475242     6.55   0.000     .2180623    .4043538
       e_3_3 |  -.7166272   .0555215   -12.91   0.000    -.8254474    -.607807
       e_4_3 |   .1148438   .0461725     2.49   0.013     .0243474    .2053403
       e_1_4 |   .1642086   .8052131     0.20   0.838     -1.41398    1.742397
       e_2_4 |   .1716925   .3266643     0.53   0.599    -.4685577    .8119427
       e_3_4 |   -.045211   .4345508    -0.10   0.917    -.8969149    .8064929
       e_4_4 |  -.5349141   .4618838    -1.16   0.247     -1.44019    .3703615
------------------------------------------------------------------------------

. 
. parmest, saving(output, replace)   
file output.dta saved

. 
. *Figures 1 and 2
. use output.dta, clear

. keep if eq =="ELAS_INC" | ((parm=="e_1_1" | parm=="e_2_2" | parm=="e_3_3" | parm=="e_4_4") & eq=="ELAS_UNCOMP")
(87 observations deleted)

. svmat elas, name(quaids)

. save output.dta, replace
file output.dta saved

. gen rw = _n

. 
. tw (rcap min95 max95 rw , horizontal) (scatter rw estimate) (scatter rw quaids1) if eq =="ELAS_INC" , ylabel(1 "Proteins" 2 "F & V" 3 "Dairy"
>  4 "Flours", angle(horizontal)) yti("Food Group") xti("Estimate") graphr(color(white)) legend(order(1 "95% CI" 2 "QUAIDSCE" 3 "QUAIDS") rows(
> 1)) scheme(s2mono)

. 
. tw (rcap min95 max95 rw , horizontal) (scatter rw estimate) (scatter rw quaids1) if eq =="ELAS_UNCOMP" , ylabel(5 "Proteins" 6 "F & V" 7 "Dai
> ry" 8 "Flours", angle(horizontal)) yti("Food Group") xti("Estimate") graphr(color(white)) legend(order(1 "95% CI" 2 "QUAIDSCE" 3 "QUAIDS") ro
> ws(1)) scheme(s2mono)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\juanc\Documents\example.log
  log type:  text
 closed on:  27 Nov 2024, 12:45:03
-----------------------------------------------------------------------------------------------------------------------------------------------
