----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\jccaro\Documents\example.log
  log type:  text
 opened on:  29 Jul 2023, 14:41:11

. set seed 123456

. *Quaidsce requires the parallel command, and this example requires the user-written command parmest, as noted below:
. ssc install parmest, replace
checking parmest consistency and verifying not already installed...
all files already exist and are up to date.

. net install quaidsce, replace force from("https://juancaros.github.io/quaidsce/")
checking quaidsce consistency and verifying not already installed...

the following files will be replaced:
    c:\ado\plus\l\lquaidsce.mlib
    c:\ado\plus\n\nlsur__quaidsce.ado
    c:\ado\plus\q\quaidsce.ado
    c:\ado\plus\q\quaidsce_c.ado
    c:\ado\plus\q\quaidsce_p.ado
    c:\ado\plus\q\quaidsce.sthlp
    c:\ado\plus\q\quaidsce_postestimation.sthlp
    c:\ado\plus\u\utils__quaidsce.mata

installing into c:\ado\plus\...
installation complete.

. net install parallel, from("https://raw.github.com/gvegayon/parallel/stable/") replace
checking parallel consistency and verifying not already installed...
all files already exist and are up to date.

. mata mata mlib index
.mlib libraries to be searched are now
    lmatabase;lmataado;lmatabma;lmatacollect;lmataerm;lmatafc;lmatagsem;lmatalasso;lmatamcmc;lmatameta;lmatami;lmatamixlog;lmatanumlib;lmataopt;lmatapath;lmatapostest;lmatapss;lmatasem;lmatasp;lmatasvy;lmatatab;lasdoc;lasgen;lboottest;lcmp;lcolrspace
> ;lelabel;lghk2;lgtools;lheterofactor;livreg2;lkdens;lmhtexp;lmoremata;lmoremata10;lmoremata11;lmoremata14;lparallel;lquaids;lquaidsce;lskolenik;lskolenik10;lsynth_mata_subr;lxtabond2;l_cfrmt

. parallel initialize 
N Child processes: 3
Stata dir:  C:\Program Files\Stata17/StataMP-64.exe

. 
. use https://www.stata-press.com/data/r18/food_consumption, clear
(Food consumption)

. 
. *Generated demographics and conditional censoring
. gen rural = (runiform() > 0.8)

. gen income = exp(rnormal())+exp(rnormal())

. gen aux = (n_adults + n_kids + income)*exp(rnormal())

. replace w_proteins=0 if aux<1
(269 real changes made)

. replace w_flours=0 if aux<1.5
(518 real changes made)

. replace w_fruitveg=0 if aux<2
(771 real changes made)

. replace w_misc=0 if aux>5
(2,161 real changes made)

. replace w_dairy=0 if aux>15
(777 real changes made)

. replace w_misc=1-w_dairy-w_flours-w_proteins-w_fruitveg
(4,014 real changes made)

. replace w_misc=0 if w_misc<0.00001
(60 real changes made)

. drop aux

. save foodcomp_censored.dta, replace
file foodcomp_censored.dta saved

. 
. *QUAIDS (Poi 2012)
. quaids w_dairy w_proteins w_fruitveg w_flours w_misc, prices(p_dairy p_proteins p_fruitveg p_flours p_misc) expenditure(expfd) nolog demographics(n_adults n_kids income rural) anot(1.6)
(obs = 4,160)
Calculating NLS estimates...
Calculating FGNLS estimates...
FGNLS iteration 2...
FGNLS iteration 3...
FGNLS iteration 4...

Quadratic AIDS model
--------------------
Number of obs          =       4160
Number of demographics =          4
Alpha_0                =        1.6
Log-likelihood         =  14235.245

--------------------------------------------------------------------------------
               | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
alpha          |
       alpha_1 |   .1791175   .0099537    18.00   0.000     .1596085    .1986264
       alpha_2 |   .2148549   .0164974    13.02   0.000     .1825205    .2471892
       alpha_3 |   .2134453   .0134834    15.83   0.000     .1870184    .2398722
       alpha_4 |   .0969817   .0066802    14.52   0.000     .0838888    .1100747
       alpha_5 |   .2956007   .0206161    14.34   0.000     .2551938    .3360075
---------------+----------------------------------------------------------------
beta           |
        beta_1 |  -.0033646   .0079467    -0.42   0.672    -.0189398    .0122106
        beta_2 |   .0221142   .0133223     1.66   0.097    -.0039969    .0482254
        beta_3 |   .0161694    .010665     1.52   0.129    -.0047336    .0370724
        beta_4 |  -.0081349   .0053886    -1.51   0.131    -.0186964    .0024266
        beta_5 |  -.0267841   .0168358    -1.59   0.112    -.0597816    .0062134
---------------+----------------------------------------------------------------
gamma          |
     gamma_1_1 |   .0210327   .0031275     6.73   0.000      .014903    .0271625
     gamma_2_1 |  -.0200471   .0032928    -6.09   0.000    -.0265009   -.0135933
     gamma_3_1 |  -.0007723   .0028871    -0.27   0.789     -.006431    .0048863
     gamma_4_1 |  -.0001603    .001646    -0.10   0.922    -.0033864    .0030659
     gamma_5_1 |  -.0000531   .0027613    -0.02   0.985    -.0054652    .0053591
     gamma_2_2 |   .1261986   .0064049    19.70   0.000     .1136452     .138752
     gamma_3_2 |  -.0379518   .0042524    -8.92   0.000    -.0462864   -.0296171
     gamma_4_2 |  -.0272143   .0023118   -11.77   0.000    -.0317453   -.0226833
     gamma_5_2 |  -.0409854   .0048055    -8.53   0.000    -.0504041   -.0315667
     gamma_3_3 |    .045229   .0049406     9.15   0.000     .0355456    .0549124
     gamma_4_3 |  -.0013681   .0021276    -0.64   0.520    -.0055381     .002802
     gamma_5_3 |  -.0051369   .0039922    -1.29   0.198    -.0129614    .0026877
     gamma_4_4 |   .0393958    .001899    20.75   0.000     .0356738    .0431179
     gamma_5_4 |  -.0106532   .0019159    -5.56   0.000    -.0144082   -.0068982
     gamma_5_5 |   .0568285   .0068471     8.30   0.000     .0434085    .0702485
---------------+----------------------------------------------------------------
lambda         |
      lambda_1 |  -.0022579   .0019509    -1.16   0.247    -.0060816    .0015658
      lambda_2 |   .0022896   .0032975     0.69   0.487    -.0041734    .0087526
      lambda_3 |  -.0047462   .0026369    -1.80   0.072    -.0099145     .000422
      lambda_4 |  -.0033975    .001356    -2.51   0.012    -.0060551   -.0007398
      lambda_5 |    .008112   .0041698     1.95   0.052    -.0000607    .0162847
---------------+----------------------------------------------------------------
eta            |
eta_n_adults_1 |   .0024864   .0011353     2.19   0.029     .0002613    .0047115
eta_n_adults_2 |  -.0005599   .0019326    -0.29   0.772    -.0043478    .0032279
eta_n_adults_3 |   .0003418   .0015647     0.22   0.827     -.002725    .0034086
eta_n_adults_4 |   .0047115   .0007537     6.25   0.000     .0032342    .0061888
eta_n_adults_5 |  -.0069797   .0025479    -2.74   0.006    -.0119735    -.001986
  eta_n_kids_1 |  -.0005013   .0008102    -0.62   0.536    -.0020892    .0010867
  eta_n_kids_2 |   .0015688   .0015726     1.00   0.318    -.0015134     .004651
  eta_n_kids_3 |  -.0012188   .0008015    -1.52   0.128    -.0027898    .0003522
  eta_n_kids_4 |   .0039078   .0003804    10.27   0.000     .0031623    .0046534
  eta_n_kids_5 |  -.0037565   .0014331    -2.62   0.009    -.0065654   -.0009476
  eta_income_1 |  -.0027299   .0003751    -7.28   0.000    -.0034651   -.0019947
  eta_income_2 |    .001676   .0005148     3.26   0.001      .000667     .002685
  eta_income_3 |   .0026424   .0003795     6.96   0.000     .0018985    .0033862
  eta_income_4 |   .0005768   .0001545     3.73   0.000     .0002741    .0008795
  eta_income_5 |  -.0021653   .0005641    -3.84   0.000    -.0032709   -.0010596
   eta_rural_1 |  -.0019651   .0020639    -0.95   0.341    -.0060103      .00208
   eta_rural_2 |  -.0000747    .003645    -0.02   0.984    -.0072187    .0070694
   eta_rural_3 |   .0014483   .0022698     0.64   0.523    -.0030005     .005897
   eta_rural_4 |  -.0019206   .0013336    -1.44   0.150    -.0045343    .0006931
   eta_rural_5 |   .0025121   .0036871     0.68   0.496    -.0047145    .0097388
---------------+----------------------------------------------------------------
rho            |
  rho_n_adults |  -.1776399   .0094992   -18.70   0.000     -.196258   -.1590218
    rho_n_kids |   .3495876   .1228608     2.85   0.004     .1087848    .5903904
    rho_income |   .0161032   .0134715     1.20   0.232    -.0103005    .0425069
     rho_rural |   .0356571   .1214418     0.29   0.769    -.2023646    .2736787
--------------------------------------------------------------------------------

. estat exp, atmeans

. mat elas = r(expelas)'

. estat uncomp, atmeans

. mat elas = elas \ vecdiag(r(uncompelas))'

. 
. *Censored QUAIDS estimation
. quaidsce w_dairy w_proteins w_fruitveg w_flours w_misc, prices(p_dairy p_proteins p_fruitveg p_flours p_misc) expenditure(expfd) nolog demographics(n_adults n_kids income rural) anot(1.6) reps(100) 
--------------------------------------------------------------------------------
Parallel Computing with Stata
Child processes: 3
pll_id         : xe8m3pab53
Running at     : C:\Users\jccaro\Documents
Randtype       : datetime
Waiting for the child processes to finish...
child process 0002 has exited without error...
child process 0003 has exited without error...
child process 0001 has exited without error...
--------------------------------------------------------------------------------
Enter -parallel printlog #- to checkout logfiles.
--------------------------------------------------------------------------------

parallel bootstrapping                                   Number of obs = 4,160
                                                         Replications  =   100

      Command: quaidsce_c w_dairy w_proteins w_fruitveg w_flours w_misc, prices(p_dairy p_proteins p_fruitveg p_flours p_misc) expenditure(expfd) nolog demographics(n_adults n_kids income rural) anot(1.6) reps(100)

--------------------------------------------------------------------------------
               |   Observed   Bootstrap                         Normal-based
               | coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
alpha          |
       alpha_1 |   .0325443   .0737823     0.44   0.659    -.1120663    .1771549
       alpha_2 |   .2901882   .0859347     3.38   0.001     .1217592    .4586172
       alpha_3 |   .1228023   .0594258     2.07   0.039     .0063299    .2392747
       alpha_4 |   .0500045   .0457358     1.09   0.274     -.039636     .139645
       alpha_5 |   .3377234   .1893879     1.78   0.075      -.03347    .7089168
---------------+----------------------------------------------------------------
beta           |
        beta_1 |   .0431038   .0205844     2.09   0.036     .0027591    .0834484
        beta_2 |  -.0433213    .038839    -1.12   0.265    -.1194444    .0328017
        beta_3 |   .0290234   .0222927     1.30   0.193    -.0146695    .0727164
        beta_4 |   .0068808   .0216603     0.32   0.751    -.0355726    .0493341
        beta_5 |  -.0292308   .0369876    -0.79   0.429     -.101725    .0432635
---------------+----------------------------------------------------------------
gamma          |
     gamma_1_1 |   .0015451   .0077089     0.20   0.841    -.0135641    .0166542
     gamma_2_1 |  -.0011345   .0073122    -0.16   0.877    -.0154662    .0131972
     gamma_3_1 |  -.0015498   .0029036    -0.53   0.594    -.0072408    .0041412
     gamma_4_1 |   .0010829   .0013285     0.82   0.415    -.0015208    .0036867
     gamma_5_1 |   .0000563   .0025195     0.02   0.982    -.0048819    .0049945
     gamma_2_2 |   .0278936   .0510459     0.55   0.585    -.0721546    .1279418
     gamma_3_2 |  -.0080389   .0168121    -0.48   0.633      -.04099    .0249122
     gamma_4_2 |  -.0073382   .0141126    -0.52   0.603    -.0349984     .020322
     gamma_5_2 |   -.011382   .0177462    -0.64   0.521     -.046164       .0234
     gamma_3_3 |   .0037853   .0204571     0.19   0.853    -.0363099    .0438805
     gamma_4_3 |  -.0022243   .0070833    -0.31   0.754    -.0161074    .0116588
     gamma_5_3 |   .0080277   .0067684     1.19   0.236    -.0052382    .0212936
     gamma_4_4 |   .0067726   .0163084     0.42   0.678    -.0251913    .0387365
     gamma_5_4 |    .001707   .0047328     0.36   0.718    -.0075692    .0109831
     gamma_5_5 |   .0015911   .0214833     0.07   0.941    -.0405155    .0436976
---------------+----------------------------------------------------------------
lambda         |
      lambda_1 |  -.0035057   .0026239    -1.34   0.182    -.0086484     .001637
      lambda_2 |   .0140432   .0101178     1.39   0.165    -.0057872    .0338737
      lambda_3 |  -.0026071   .0048608    -0.54   0.592     -.012134    .0069199
      lambda_4 |  -.0047639   .0050797    -0.94   0.348      -.01472    .0051921
      lambda_5 |  -.0040356   .0071868    -0.56   0.574    -.0181215    .0100504
---------------+----------------------------------------------------------------
delta          |
       delta_1 |   .1186905   .1125753     1.05   0.292     -.101953     .339334
       delta_2 |   .4135403   .2392568     1.73   0.084    -.0553944    .8824749
       delta_3 |   .1499172   .0643689     2.33   0.020     .0237565    .2760779
       delta_4 |   .0748043   .0722542     1.04   0.301    -.0668113      .21642
       delta_5 |   .4409224   .5069951     0.87   0.384    -.5527698    1.434614
---------------+----------------------------------------------------------------
eta            |
eta_n_adults_1 |  -.0005187   .0008797    -0.59   0.555    -.0022428    .0012055
eta_n_adults_2 |   .0002901   .0056815     0.05   0.959    -.0108455    .0114257
eta_n_adults_3 |  -.0028741   .0027996    -1.03   0.305    -.0083613    .0026131
eta_n_adults_4 |   .0053438    .002087     2.56   0.010     .0012533    .0094343
eta_n_adults_5 |  -.0022411   .0069093    -0.32   0.746     -.015783    .0113008
  eta_n_kids_1 |  -.0009998    .001523    -0.66   0.511    -.0039848    .0019851
  eta_n_kids_2 |   .0056743   .0047451     1.20   0.232    -.0036259    .0149745
  eta_n_kids_3 |  -.0029279    .002341    -1.25   0.211    -.0075163    .0016604
  eta_n_kids_4 |   .0050806   .0017872     2.84   0.004     .0015777    .0085835
  eta_n_kids_5 |  -.0068271   .0036184    -1.89   0.059    -.0139191    .0002649
  eta_income_1 |  -.0009713   .0005513    -1.76   0.078    -.0020517    .0001092
  eta_income_2 |   .0067804   .0027826     2.44   0.015     .0013266    .0122343
  eta_income_3 |   -.000598   .0018318    -0.33   0.744    -.0041884    .0029923
  eta_income_4 |   .0005306   .0006095     0.87   0.384    -.0006641    .0017253
  eta_income_5 |  -.0057417   .0021078    -2.72   0.006    -.0098728   -.0016106
   eta_rural_1 |  -.0006552   .0020175    -0.32   0.745    -.0046094     .003299
   eta_rural_2 |   .0063088   .0097161     0.65   0.516    -.0127344    .0253519
   eta_rural_3 |    .002973   .0044806     0.66   0.507    -.0058087    .0117548
   eta_rural_4 |  -.0041373   .0042189    -0.98   0.327    -.0124062    .0041316
   eta_rural_5 |  -.0044893   .0079613    -0.56   0.573    -.0200931    .0111146
---------------+----------------------------------------------------------------
rho            |
  rho_n_adults |  -.0450836   .1138701    -0.40   0.692    -.2682649    .1780976
    rho_n_kids |   .4911452   .9900489     0.50   0.620    -1.449315    2.431605
    rho_income |   .0711881   .1673509     0.43   0.671    -.2568136    .3991897
     rho_rural |   .0996159   .5651723     0.18   0.860    -1.008101    1.207333
---------------+----------------------------------------------------------------
tau            |
          p1_1 |   .0159498   .0528202     0.30   0.763    -.0875759    .1194754
          p2_1 |  -.0693572   .0758255    -0.91   0.360    -.2179725    .0792582
          p3_1 |   .0924109    .069538     1.33   0.184    -.0438811    .2287028
          p4_1 |   .0812291    .049851     1.63   0.103     -.016477    .1789352
          p5_1 |  -.0904071   .0457377    -1.98   0.048    -.1800514   -.0007629
           M_1 |   .0814687    .053392     1.53   0.127    -.0231777    .1861151
    n_adults_1 |     -.0924   .0350052    -2.64   0.008    -.1610088   -.0237912
      n_kids_1 |  -.1587953   .0238947    -6.65   0.000     -.205628   -.1119626
      income_1 |  -.1178439   .0100569   -11.72   0.000    -.1375551   -.0981327
       rural_1 |  -.0262838   .0639662    -0.41   0.681    -.1516553    .0990876
        cons_1 |    1.40383   .1798071     7.81   0.000     1.051415    1.756245
          p1_2 |   .0917762   .0690784     1.33   0.184    -.0436149    .2271673
          p2_2 |   .0783897   .0980987     0.80   0.424    -.1138803    .2706596
          p3_2 |   .0817303    .116921     0.70   0.485    -.1474306    .3108913
          p4_2 |  -.0811693   .0696266    -1.17   0.244    -.2176349    .0552963
          p5_2 |  -.1091745   .0585095    -1.87   0.062     -.223851     .005502
           M_2 |   .0522518   .0641569     0.81   0.415    -.0734933     .177997
    n_adults_2 |    .244854    .045775     5.35   0.000     .1551366    .3345714
      n_kids_2 |   .2034202   .0416739     4.88   0.000     .1217408    .2850995
      income_2 |   .1878847   .0243143     7.73   0.000     .1402296    .2355399
       rural_2 |  -.1363218   .0771402    -1.77   0.077    -.2875139    .0148703
        cons_2 |   .4352226   .2186969     1.99   0.047     .0065846    .8638607
          p1_3 |  -.0319955    .056388    -0.57   0.570    -.1425139     .078523
          p2_3 |   .0545214   .0642688     0.85   0.396    -.0714431    .1804859
          p3_3 |  -.0352614   .0778113    -0.45   0.650    -.1877688     .117246
          p4_3 |  -.0815103   .0476136    -1.71   0.087    -.1748313    .0118107
          p5_3 |  -.0299038   .0427923    -0.70   0.485    -.1137752    .0539675
           M_3 |   .1660317   .0559788     2.97   0.003     .0563152    .2757482
    n_adults_3 |   .1463998   .0424448     3.45   0.001     .0632095      .22959
      n_kids_3 |   .1690891   .0282433     5.99   0.000     .1137333    .2244449
      income_3 |    .170047   .0149375    11.38   0.000     .1407701     .199324
       rural_3 |   .0152621   .0576957     0.26   0.791    -.0978194    .1283437
        cons_3 |  -.6477069    .176887    -3.66   0.000     -.994399   -.3010148
          p1_4 |  -.0198716   .0537101    -0.37   0.711    -.1251415    .0853982
          p2_4 |  -.0225314   .0779248    -0.29   0.772    -.1752612    .1301984
          p3_4 |   .0360461   .0985247     0.37   0.714    -.1570588    .2291511
          p4_4 |  -.1490798   .0535695    -2.78   0.005    -.2540742   -.0440854
          p5_4 |  -.0064983   .0495982    -0.13   0.896     -.103709    .0907125
           M_4 |   .1507632   .0547413     2.75   0.006     .0434722    .2580543
    n_adults_4 |   .1641544   .0490946     3.34   0.001     .0679308    .2603779
      n_kids_4 |   .1765189   .0324084     5.45   0.000     .1129996    .2400381
      income_4 |   .1754497   .0157807    11.12   0.000     .1445201    .2063792
       rural_4 |   -.057546   .0644032    -0.89   0.372     -.183774    .0686819
        cons_4 |    -.28405   .1689452    -1.68   0.093    -.6151765    .0470766
          p1_5 |  -.1396256   .1189624    -1.17   0.241    -.3727877    .0935365
          p2_5 |   .0632446   .1430842     0.44   0.658    -.2171954    .3436846
          p3_5 |  -.2813643   .1710201    -1.65   0.100    -.6165575    .0538288
          p4_5 |  -.1724522   .1280893    -1.35   0.178    -.4235026    .0785982
          p5_5 |  -.2249961   .0457923    -4.91   0.000    -.3147475   -.1352448
           M_5 |   .6498005   .0966114     6.73   0.000     .4604457    .8391553
    n_adults_5 |  -.0301001   .0955511    -0.32   0.753    -.2173768    .1571765
      n_kids_5 |  -.1108622   .0638175    -1.74   0.082    -.2359423    .0142178
      income_5 |   .0428401   .0212264     2.02   0.044     .0012372     .084443
       rural_5 |   .1348892   .1518553     0.89   0.374    -.1627418    .4325201
        cons_5 |  -.3092887   .2858262    -1.08   0.279    -.8694977    .2509203
---------------+----------------------------------------------------------------
ELAS_INC       |
           e_1 |   1.219869   .0875185    13.94   0.000     1.048336    1.391402
           e_2 |   1.071795   .0456599    23.47   0.000     .9823031    1.161287
           e_3 |    1.07942   .0550915    19.59   0.000     .9714423    1.187397
           e_4 |   1.084032    .087039    12.45   0.000     .9134388    1.254625
           e_5 |   .6946564   .2661411     2.61   0.009     .1730295    1.216283
---------------+----------------------------------------------------------------
ELAS_UNCOMP    |
         e_1_1 |  -.9906752   .0538727   -18.39   0.000    -1.096264   -.8850866
         e_2_1 |  -.0775778   .0434523    -1.79   0.074    -.1627428    .0075872
         e_3_1 |  -.0288765   .0307664    -0.94   0.348    -.0891776    .0314246
         e_4_1 |   .0053397   .0208436     0.26   0.798     -.035513    .0461924
         e_5_1 |  -.0828023   .0333362    -2.48   0.013    -.1481401   -.0174645
         e_2_2 |  -.9561006   .1590702    -6.01   0.000    -1.267872   -.6443288
         e_3_2 |  -.0292375   .0529662    -0.55   0.581    -.1330494    .0745744
         e_4_2 |   -.021821   .0613963    -0.36   0.722    -.1421556    .0985136
         e_5_2 |  -.0451183   .0585255    -0.77   0.441    -.1598262    .0695896
         e_3_3 |  -.9912334   .0846303   -11.71   0.000    -1.157106   -.8253611
         e_4_3 |  -.0247341   .0316797    -0.78   0.435    -.0868252     .037357
         e_5_3 |   .0161732   .0347094     0.47   0.641     -.051856    .0842024
         e_4_4 |  -.9466958   .1239681    -7.64   0.000    -1.189669   -.7037228
         e_5_4 |  -.0142667   .0515983    -0.28   0.782    -.1153975    .0868641
         e_5_5 |  -.8931282   .1551423    -5.76   0.000    -1.197202   -.5890549
---------------+----------------------------------------------------------------
ELAS_COMP      |
         e_1_1 |  -.8429169   .0470718   -17.91   0.000    -.9351759   -.7506579
         e_2_1 |   .3784271   .0549848     6.88   0.000     .2706589    .4861954
         e_3_1 |   .2067718   .0301744     6.85   0.000      .147631    .2659126
         e_4_1 |   .1155995   .0200278     5.77   0.000     .0763458    .1548532
         e_5_1 |   .1873953   .0184492    10.16   0.000     .1512356     .223555
         e_2_2 |   -.555448   .1629761    -3.41   0.001    -.8748752   -.2360208
         e_3_2 |   .1778065   .0515966     3.45   0.001      .076679    .2789341
         e_4_2 |   .0750549   .0601874     1.25   0.212    -.0429102    .1930201
         e_5_2 |   .1922813   .0544769     3.53   0.000     .0855086     .299054
         e_3_3 |  -.7827164   .0816864    -9.58   0.000    -.9428188    -.622614
         e_4_3 |    .072831   .0311943     2.33   0.020     .0116913    .1339706
         e_5_3 |   .2552616   .0334205     7.64   0.000     .1897586    .3207647
         e_4_4 |  -.8487138   .1195783    -7.10   0.000    -1.083083   -.6143447
         e_5_4 |   .2258434   .0485148     4.66   0.000     .1307562    .3209306
         e_5_5 |  -.7392638   .1066516    -6.93   0.000    -.9482971   -.5302304
--------------------------------------------------------------------------------

. 
. parmest, saving(output, replace)   
file output.dta saved

. 
. *Tables and Figures
. *Table 1
. use foodcomp_censored.dta, clear
(Food consumption)

. foreach var in w_dairy w_proteins w_fruitveg w_flours w_misc {
  2.         gen d`var' = 0
  3.         replace d`var' = 1 if `var'==0
  4. }
(837 real changes made)
(279 real changes made)
(795 real changes made)
(576 real changes made)
(66 real changes made)

. 
. sum w* dw*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     w_dairy |      4,160    .1211264    .0974369          0          1
  w_proteins |      4,160    .3738147    .1703384          0   .9206853
  w_fruitveg |      4,160    .1931751    .1331943          0     .82085
    w_flours |      4,160    .0903866    .0658944          0   .4984845
      w_misc |      4,160    .2214972    .2162329          0          1
-------------+---------------------------------------------------------
    dw_dairy |      4,160    .2012019    .4009468          0          1
 dw_proteins |      4,160    .0670673    .2501686          0          1
 dw_fruitveg |      4,160    .1911058    .3932194          0          1
   dw_flours |      4,160    .1384615    .3454253          0          1
     dw_misc |      4,160    .0158654    .1249697          0          1

. 
. *Figures 1 and 2
. use output.dta, clear

. keep if eq =="ELAS_INC" | ((parm=="e_1_1" | parm=="e_1_1" | parm=="e_2_2" | parm=="e_3_3" | parm=="e_4_4" | parm=="e_5_5") & eq=="ELAS_UNCOMP")
(139 observations deleted)

. svmat elas, name(quaids)

. save output.dta, replace
file output.dta saved

. gen rw = _n

. 
. tw (rcap min95 max95 rw , horizontal) (scatter rw estimate) (scatter rw quaids1) if eq =="ELAS_INC" , ylabel(1 "Dairy" 2 "Proteins" 3 "F & V" 4 "Flours" 5 "Misc", angle(horizontal)) yti("Food Group") xti("Estimate") graphr(color(white)) legend(orde
> r(1 "95% CI" 2 "QUAIDSCE" 3 "QUAIDS") rows(1)) scheme(s2mono)

. 
. tw (rcap min95 max95 rw , horizontal) (scatter rw estimate) (scatter rw quaids1) if eq =="ELAS_UNCOMP" , ylabel(6 "Dairy" 7 "Proteins" 8 "F & V" 9 "Flours" 10 "Misc", angle(horizontal)) yti("Food Group") xti("Estimate") graphr(color(white)) legend(
> order(1 "95% CI" 2 "QUAIDSCE" 3 "QUAIDS") rows(1)) scheme(s2mono)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\jccaro\Documents\example.log
  log type:  text
 closed on:  29 Jul 2023, 23:37:31
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
